"use client";

import { useTranslations } from "next-intl";
import React, { useState } from "react";

import ContactUs from "@/custom/ContactUs";

export default function About() {
  const t = useTranslations("About");

  return (
    <>
      <section className=" max-w-[1280px] mx-auto mobile:w-full pt-10 mobile:pt-4 relative">
        <img
          src="/about-us-background-image.jpg"
          alt="about"
          className="w-full h-[450px] object-cover rounded-2xl mobile:rounded-none"
        />
        <div className="absolute top-1/2 left-1/2 transform -translate-x-1/2 -translate-y-1/2 text-[52px] font-bold text-white z-50 mobile:text-2xl mobile:w-[300px] mobile:flex mobile:items-center mobile:justify-center mobile:flex-col">
          TATOYAN & PARTNERS
          <p className="text-3xl text-center mobile:text-xl">Law Office</p>
        </div>
      </section>
      <section className="max-w-[1280px] mx-auto mobile:w-full mt-16 mobile:mt-0">
        <div className="flex flex-col gap-40 mobile:gap-12 bg-[#212121] shadow-2xl rounded-2xl p-10 mobile:p-5 mobile:rounded-none ">
          <div className="grid gap-6 text-center mobile:m-5">
            <h2 className="text-2xl font-bold">
              Ինչո՞ւ վստահել «Թաթոյան և գործընկերներ» փաստաբանական գրասենյակին:
            </h2>
            <p className="text-muted-light leading-[120%]">
              {/* {t("titile-description2")} */}
              Թաթոյան և գործընկերներ փաստաբանական գրասենյակում գիտեն ճիշտ
              լուծումներ և գտնում են Ձեզ համար հնարավոր լավագույն լուծումները՝
              անկախ խնդրի բարդությունից։ Մեր փորձառու փաստաբաններն արագ և
              արդյունավետ կլուծեն խնդիրները թե՛ բանակցությունների սեղանի շուրջ և
              թե՛ դատարանի դահլիճում: «Թաթոյան և գործընկերներ փաստաբանական
              գրասենյակ» ՍՊ ընկերությունը առաջարկում է իրավաբանական
              ծառայություններ ֆիզիկական և իրավաբանական անձանց հետևյալ
              ոլորտներում` դատական ներկայացուցչություն (քաղաքացիական, քրեական,
              տնտեսական  և վարչական գործերով), իրավաբանական աջակցություն
              քաղաքացիներին և իրավաբանական անձանց, իրավաբանական փորձաքննություն
              և խորհրդատվություն, վեճերի այլընտրանքային կարգավորում, փաստաթղթերի
              կազմում: Մեր ընկերության նպատակն է ապահովել ծախսային տեսանկյունից
              արդյունավետ և նպատակահարմար լուծումներ, ինչպես նաև տրամադրել
              իրավաբանական պաշտպանություն մեր վստահորդներին: Ընկերության
              փաստաբանները ձեռք են բերել խնդիրները վստահորդների տեսանկյունից
              տեսնելու, կարիքները գնահատելու և հասկանալու հմտություն, ինչպես նաև
              վերլուծելու բոլոր հնարավոր խնդիրները` լավագույն լուծումներն
              առաջարկելու նպատակով: Մեր թիմը կազմված է փորձառու իրավաբան
              մասնագետներից, որոնք ծառայությունները մատուցում են հայերեն,
              ռուսերեն, անգլերեն և ֆրանսերեն լեզուներով: «Թաթոյան և գործընկերներ
              փաստաբանական գրասենյակ» ընկերությունը բարձր է գնահատում
              գործընկերությունը և համագործակցությունը իր վստահորդների հետ, և
              կանգնած է իրենց իրավունքների պաշտպանության համար մինչև բոլոր
              խնդիրների կարգավորումը։
            </p>
          </div>
          <div className="w-full max-w-[1280px] flex gap-4 mobile:flex-col-reverse">
            <div className="flex flex-col items-center justify-center gap-10">
              <div className="flex flex-col gap-4 max-w-[80%] mobile:max-w-full">
                <h2 className="text-2xl font-bold">ԱՐՄԵՆ ԲԱՂԴԱՍԱՐՅԱՆ</h2>
                
                <p>Ընկերության տնօրեն</p>
                <p className="text-sm text-muted-light">
                  Արմեն Բաղդասարյանը հանդիսանում է «Թաթոյան և գործընկերներ
                  փաստաբանական գրասենյակ» ՍՊ ընկերության տնօրենը: Մասնագիտական
                  աշխատանքը սկսել է 1999թ.-ից` Քրեական և զինվորական գործերով,
                  այնուհետև շարունակել է աշխատանքը մարդու իրավունքների ոլորտում`
                  2007-ից ի վեր ներկայացրել է ֆիզիկական և իրավաբանական անձանց
                  շահերը քաղաքացիական, քրեական և վարչական գործերով
                  դատարաններում: Նրա աշխատանքային փորձը երկուստեք հանրային և
                  մասնավոր սեկտորում, ինչպես նաև մի շարք մասնագիտական
                  դասընթացները տարբեր երկրներում, Ա. Բաղդասարյանին դարձրել են
                  բարձր որակավորում ունեցող մասնագետ` բարձրակարգ իրավաբանական
                  ծառայություններ տրամադրող իրավաբանական գրասենյակի ղեկավար:
                </p>
              </div>
            </div>
            <div className="max-w-[50%] mobile:max-w-full">
              <img
                src="/armen-baghdasaryan.jpg"
                alt="armen-baghdasaryan"
                className="rounded-xl"
              />
            </div>
          </div>
          <div className="grid gap-6 text-center mobile:m-5">
            <h2 className="font-bold text-3xl  text-muted-light mobile:text-xl">
              {t("mission")}
            </h2>
            <p className="font-medium text-muted-light text-sm">
              {/* {t("mission-description")} */}
              «Թաթոյան և գործընկերներ փաստաբանական գրասենյակ» ՍՊ ընկերությունը
              առաջարկում է իրավաբանական ծառայություններ ֆիզիկական և իրավաբանական
              անձանց հետևյալ ոլորտներում` դատական ներկայացուցչություն
              (քաղաքացիական, քրեական, տնտեսական և վարչական գործերով),
              իրավաբանական աջակցություն քաղաքացիներին և իրավաբանական անձանց,
              իրավաբանական փորձաքննություն և խորհրդատվություն, վեճերի
              այլընտրանքային կարգավորում, քաղաքացիության և երկքաղաքացիության հետ
              կապված խորհրդատվություն և փաստաթղթերի կազմում: Մեր ընկերության
              նպատակն է ապահովել ծախսային տեսանկյունից արդյունավետ և
              նպատակահարմար լուծումներ, ինչպես նաև տրամադրել իրավաբանական
              պաշտպանություն մեր վստահորդներին: Ընկերության փաստաբանները ձեռք են
              բերել խնդիրները վստահորդների տեսանկյունից տեսնելու, կարիքները
              գնահատելու և հասկանալու հմտություն, ինչպես նաև վերլուծելու բոլոր
              հնարավոր ելքերը` լավագույն լուծումն առաջարկելու նպատակով: Մեր թիմը
              կազմված է փորձառու իրավաբան մասնագետներից, որոնք ծառայությունները
              մատուցում են հայերեն, ռուսերեն և անգլերեն լեզուներով: «Թաթոյան և
              գործընկերներ փաստաբանական գրասենյակ» ընկերությունը բարձր է
              գնահատում գործընկերությունը և համագործակցությունը իր վստահորդների
              հետ, և կանգնած է իրենց իրավունքների պաշտպանության համար մինչև
              բոլոր խնդիրների կարգավորումը
            </p>
          </div>
        </div>
      </section>
      <ContactUs />
    </>
  );
}
